{
    "deaths": [
            {"medium": "Title Sequence",
            "image": "https://static.wikia.nocookie.net/southpark/images/c/c0/Screen_Shot_2018-01-21_at_4.27.03_AM.png",
            "title": "Seasons 7-11",
            "description": "Decapitated by a pair of scissors."},
            {"medium": "Title Sequence",
            "image": "https://static.wikia.nocookie.net/southpark/images/a/a4/Screen_Shot_2018-01-21_at_6.04.41_AM.png/",
            "title": "Syndication",
            "description": "Reduced to a skeleton after getting touched by Death."},
            {"medium": "Television",
            "season": "1",
            "image": "https://static.wikia.nocookie.net/southpark/images/4/4f/CartmanGetsanAnalProbe14.jpg",
            "title": "Cartman Gets an Anal Probe",
            "description": "Blasted by the Visitors' UFO, trampled by a herd of cattle, then run over by Officer Barbrady's police cruiser. Kenny was still alive after being shot and trampled, it was Barbrady's car which delivered the fatal blow. To prove to a denying Cartman that Kenny is dead, his body gets whacked with a stick by Stan and he gets his head pulled off by Kyle. His body is then eaten away at by rats. After Kenny's body is eaten, Kyle says \"Rats.\""},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Weight Gain 4000",
            "description": "Gets crushed by a prop during the school play. Mayor McDaniels then exclaims \"Oh my God\" but the rest of the catchphrase was not said. It's unconfirmed if this did kill Kenny and he returned later in the episode, but if not, he is certainly killed later on."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Weight Gain 4000",
            "description": "Shot by Mr. Garrison when trying to shoot Kathie Lee Gifford, which launches him into the air, and he is impaled on a flag pole. Both \"Oh my God, they killed Kenny!\" and \"You bastards!\" are said entirely by Kyle in this episode, as Stan is not present at the time."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Volcano",
            "description": "Kenny seemingly gets crushed by a large volcanic boulder ejected from the volcano. Kyle says the \"Oh my God! They killed Kenny!\" line in this episode, but Kenny comes out from behind the boulder and says he is okay, only for his arm to catch fire and the boulder to roll over him, actually crushing him this time."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Volcano",
            "description": "He is later seen alive after the lava travels through the trench, only to be shot by Ned when he drops his gun on the ground."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Big Gay Al's Big Gay Boat Ride",
            "description": "His arms are ripped off by two Middle Park Cowboy players before a third tackles him, decapitating him in the process. The \"Oh my God! They killed Kenny!\" line is said by Kyle in this episode."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "An Elephant Makes Love to a Pig",
            "description": "Knocked into a microwave oven with a chair by a mutant clone of Stan, and the microwave turns on, cooking him to death. Kyle says the \"Oh my God! They killed Kenny!\" line to the mutant clone, and then he screams \"You bastard!\" at the microwave."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Death",
            "description": "Killed when Death touches him. Kyle yells \"Oh my God! They killed Kenny!\" and \"You bastards!\" at Death."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Pinkeye",
            "description": "At the beginning of the episode, he is crushed by the MIR Space Station when it falls out of orbit and crashes on Earth. Revived as a zombie via Worcestershire sauce embalming."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Pinkeye",
            "description": "The zombified Kenny is cut in half with a chainsaw by Kyle to end the zombie curse. The \"Oh my God, they killed Kenny!\" line is said by Kyle, though \"they\" is changed to \"I\", reflecting the fact that it is he who kills Kenny this time. Kyle says to himself \"You bastard!\" (when he should have said \"I'm a bastard!\" unless speaking in the third person)."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Pinkeye",
            "description": "Rises from his grave again at the end of the episode, but is immediately crushed by a falling angel statue and then by a crashing airplane. Stan and Kyle are not there to say their usual lines, as they had left with Cartman to enjoy their Halloween candy."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Damien",
            "description": "After he is turned into a duck-billed platypus by Damien, he gets shot by Jimbo after Jesus and Satan's match near the end of the episode."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Starvin' Marvin",
            "description": "Attacked by mutant turkeys; loses an eye in the attack."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Tom's Rhinoplasty",
            "description": "Pierced by a scimitar carelessly swung by Ms. Ellen during her apprehension by Iraqi soldiers, and pinned to the wall of the third grade classroom. Stan then exclaims \"Oh my God! She killed Kenny!\""},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Mecha-Streisand",
            "description": "While Mecha-Streisand is wrecking the town, Kenny dodges several things that would be the perfect cause for his death. Instead, it comes when he finds himself in a playground and begins to play tetherball with himself. He is scooped up by the rope, tied to the pole, and asphyxiated."},
            {"medium": "Television",
            "season": "1",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Cartman's Mom is a Dirty Slut",
            "description": "Dragged onto train tracks by a go-kart and run over by a train. Later, a video of the incident (recorded by Marvin Marsh) is shown on America's Stupidest Home Videos, and wins the $10,000 grand prize. Upon seeing this, Stan yells: \"Oh my God! They videotaped killing Kenny!\", and Kyle shouts: \"You bastards!\""},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Cartman's Mom is Still a Dirty Slut",
            "description": "Kills himself sacrificially with electrocution while turning on a hospital generator in an attempt to revitalize Dr. Mephesto."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Chickenlover",
            "description": "Prior to Kenny's actual death, three near-death experiences occur that fool Stan and Kyle into thinking Kenny was killed. First, a car tips upside-down and crushes him, but the sunroof is open and he steps out; he then flies off a swingset into a brick wall, but survives; a gun misfires and Kenny appears to be shot in the arm, but the bullet narrowly misses him and gets caught in his sleeve; during the parade in the credits, a tree falls and crushes Kenny, finally killing him. The first two times that Kenny is thought to have been killed, Stan says, \"Oh my god, they killed...\" They then show Kenny still alive and Stan finishes with, \"Oh, never mind.\" The third time, however, he says, \"Goddammit!\" Nothing is said when the tree falls on Kenny during the ending credits, as everyone seems to be oblivious to his death."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Ike's Wee Wee",
            "description": "Falls into an open grave and is crushed by the gravestone beside it when it crumbles and topples over. Kyle says \"You bastards\" without a care, due to the revelation that his brother, Ike, was adopted, and Canadian. After Ike's bris, Kenny is in the classroom, in his seat, but after Mr. Garrison speaks, Kenny's seat is empty."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Conjoined Fetus Lady",
            "description": "Killed by an overpowered dodgeball throw from a Chinese opponent. Kyle, in pain, weakly says the \"You bastards\" line."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Mexican Staring Frog of Southern Sri Lanka",
            "description": "Torn apart by two audience members of the <i>Jesus and Pals</i> show during a riot on the show's set."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "City on the Edge of Forever (Flashbacks)",
            "description": "Abducted by the Big Black Scary Monster."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "City on the Edge of Forever (Flashbacks)",
            "description": "In Cartman's flashback, Kenny is crushed by Arthur Fonzarelli's bike."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Summer Sucks",
            "description": "In a flashback to when he was in kindergarten (or preschool), he was blown up by a firecracker which he held for too long. Stan yells \"My gosh kill Kenny!\"; Kyle shouts \"Oo bastards!\""},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Summer Sucks",
            "description": "Crushed by the bleachers at Stark's Pond when a large firework snake grows out of control and breaks the bleachers' support."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Chef's Chocolate Salty Balls",
            "description": "Trampled by a crowd leaving a movie theater. Stan and Kyle are not present; instead, a moviegoer stops as he exits, finding a penny on the ground, and says, \"Oh my God, I found a penny!\", and his friend replies, \"You bastard!\""},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Chickenpox",
            "description": "Close to the end of this episode, he is laughing with everyone, but flatlines due to a contracted fatal case of chickenpox."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Roger Ebert Should Lay off the Fatty Foods",
            "description": "His head explodes as a result of a seizure caused by the intensity of a planetarium demonstration when Stan and Kyle examine the control booth. Stan shouts \"Oh my god! We killed Kenny!\"; Kyle says \"We're bastards!\""},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Clubhouses",
            "description": "Trampled in a mosh pit in Cartman's tree house. Cartman is the one who says \"Oh my God, they killed Kenny!\" and a passing Kyle exclaims \"You bastards!\" at the treehouse before moving along."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Cow Days",
            "description": "Pierced by the horns of the bull Cartman is riding."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Chef Aid",
            "description": "Ozzy Osbourne bites his head off. The regular post-death line is changed to \"Oh my God, Ozzy Osbourne bit Kenny's head off!\". This is a reference to two incidents where Ozzy bit the heads off of live animals. One was a dove at a contract signing, and the other was when he bit the head off a bat in concert. However, Kenny is spontaneously revived moments later and can be seen standing next to Stan and Kyle in the crowd."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Spookyfish",
            "description": "Drowned and mauled by Stan's evil goldfish. The trademark post-Kenny-death catchphrase is not said since Stan and Kyle are talking about the fish."},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Merry Christmas Charlie Manson!",
            "description": "Shot dead by police while attempting to surrender himself, Charles Manson, and Kyle. Charles Manson: \"Oh my god! They killed the little orange-coat kid!\" Kyle: \"You bastards!\""},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Gnomes",
            "description": "Crushed by a derailed mining cart containing underpants. Amusingly, the boys say their usual speech rather quickly and emotionlessly (The speech comes out \"ohmygodtheykilledkennyyoubastards.\") and do not seem very saddened by his death, since all they cared about was finishing the paper for the Prop 10 meeting. As Stan and Kyle continue, the Underpants Gnomes look in awe at what just happened and interrupt the boys' speech with \"Holy shit, we killed your friend!\""},
            {"medium": "Television",
            "season": "2",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Prehistoric Ice Man",
            "description": "Caught in the conveyor belt in front of the prehistoric ice man exhibit. Stan says the first line as per usual, but Kyle does not say his line and instead says, \"What? I'm not talking to you,\" since they are fighting over the ice man's name."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Rainforest Shmainforest",
            "description": "While talking with Kelly, Kenny gets struck by lightning. Stan and Kyle then say their usual lines. When Kelly asks who \"they\" are, Stan and Kyle respond with \"You know. They\" and \"They're bastards.\" Kelly proceeds to do CPR on Kenny and successfully revives him."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Spontaneous Combustion",
            "description": "Spontaneously combusts while holding in a fart. Because of the shocking and suddenness of the death, there is a long pause before the usual lines are said."},
            {"medium": "Television",
            "season": "3",
            "image": "",
            "title": "The Succubus",
            "description": "Dies in an unknown manner while waiting for Chef at the bus stop, but miraculously revives at dawn."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Succubus",
            "description": "Smashed to death by the succubus. Cartman, whose eyes are bandaged due to a botched eye surgery, asks \"What? What happened you guys? Is Kenny okay?\" His corpse (presumably from his first death in the episode, since his body was totally pulverized in the second death) is later taken to Cartman's optometrist at the end of the episode, claiming that Kenny is an organ donor and wants to donate his eyes to Cartman."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Jakovasaurs",
            "description": "Killed by a bear while impersonating a deer, distracting Cartman."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Tweek vs. Craig",
            "description": "Gets tossed into a box of rusty nails. Mr. Adler picks up his dead body and sees his dead lover in Kenny's hood. Stan and Kyle look on and comment on how messed up it is."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Sexual Harassment Panda",
            "description": "Pulled by a magnet into a giant fan, as part of a demonstration given by misfit mascot Jimmy, the \"Don't Hold On To A Large Magnet While Someone Uses A Fan Nearby\" Falcon."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Jewbilee",
            "description": "Sacrificially smacks his head into the conch shell that Moses is trapped in, opening it and saving the Jews. The usual post-death lines are not said, partially due to Stan being absent in this episode."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Chinpokomon",
            "description": "Has a seizure due to the Chinpokomon video game and spends most of the episode catatonic; bursts at the end of the episode, revealing that he was filled with rats."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Korn's Groovy Pirate Ghost Mystery",
            "description": "Destroyed by a snow speeder while wearing an ED-209 costume."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Hooked on Monkey Fonics",
            "description": "Beaten against everything in Cartman's bedroom by the Fonics Monkey. Stan says \"Oh my God, Fonics Monkey killed Kenny!\" Instead of Kyle's \"You bastard!\" line, Cartman says, \"You're damn straight he did.\" because Kyle was not present. However, due to a continuity error, he is later seen alive with Kelly at the dance."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Starvin' Marvin in Space",
            "description": "Gets frozen in carbonite by the CIA as a gift for Sally Struthers."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Red Badge of Gayness",
            "description": "Burned to death by a US National Guard warning flare. However, Stan's grandfather Marvin Marsh shouts \"You bastards!\" instead of Kyle, to which Kyle angrily shouts \"Hey!\""},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Mr. Hankey's Christmas Classics",
            "description": "Crushed by a chandelier while singing \"Have Yourself a Merry Little Christmas\"."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Are You There God? It's Me, Jesus",
            "description": "His insides explode due to the pressure buildup from a tampon stuck in his anus."},
            {"medium": "Television",
            "season": "3",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "World Wide Recorder Concert",
            "description": "Dies from massive defecation after playing \"The Brown Note\". However, due to a continuity error, he seen alive on the bus at the end of the episode."},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Tooth Fairy Tats 2000",
            "description": "Thrown into the Platt River with cement shoes by Loogie's goons, however, the river is too shallow for him to sink, so during the credits, he begins hopping toward the shore. After a few hops, he falls into a concealed trench in the water and drowns. The lines of Stan and Kyle are not heard but Timmy does ride past shouting \"TIMMY!\" in his usual fashion."},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Cartman's Silly Hate Crime 2000",
            "description": "Crushed by bricks, meant to be a Cartman test dummy, after flying off a sled. Stan says \"Oh my God we killed Kenny.\" and Kyle replies \"We killed Kenny?\" Stan replies in a businesslike manner \"We killed Kenny. We're bastards.\" Though he had already died, the boys still included a drawing of him when giving their presentation to the governor."},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Quintuplets 2000",
            "description": "Shot accidentally by police in an Elián González-style raid in Romania."},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Timmy 2000",
            "description": "Bashed in the face with a frying pan by Cartman due to Cartman's Christina Aguilera hallucinations. Stan and Kyle deliver the catchphrase in an unusually relaxed soothing manner due to having overdosed on Ritalin."},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Cartman Joins NAMBLA",
            "description": "Killed in a dream by his newborn alien-like brother. His father says \"Oh my God, it killed Kenny!\" and his mother shouts \"Bad baby!\""},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Cartman Joins NAMBLA",
            "description": "Crushed by an ambulance after Stuart is loaded therein."},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Cherokee Hair Tampons",
            "description": "Crushed by a piano being lowered to the ground from the top floor of a building beside him, just after angrily leaving for home while Stan is very upset and sobbing because Kyle may die of kidney failure unless he gets one of Cartman's kidneys. Before leaving he says in his muffled way: \"You never seem to care when I die!\" After Stan cries some more and talks about how Kyle is going to die, Kenny says, \"Now that does it! I have had enough of this bullshit! Screw you, Stan, I'm going home!\" a line which is usually delivered by Cartman."},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Chef Goes Nanners",
            "description": "Explodes from gas buildup when a massive dose of antacid tablets (thought to be mints) is exposed to water that he drinks. Everybody present laughs and applauds, and Stan says, \"That was a good one.\""},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Something You Can Do with Your Finger",
            "description": "Flattened by an elevator just prior to Fingerbang's performance in the shopping mall."},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Do the Handicapped Go to Hell?",
            "description": "As the boys cross the traffic light on their way to church, Kenny gets run over by a bus heading to Mexico. He is revealed, however, to still be alive in the follow-up episode \"Probably\"."},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Fourth Grade",
            "description": "Dragged to death over pavement by Timmy's wheelchair while attempting to fix it à la Speed. Stan: \"Well now who didn't see that coming.\" Yet near the end, he makes a cameo appearance and then disappears before the scene ends."},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Trapper Keeper",
            "description": "Smashed against a wall by Cartman's bedroom door when the monstrous possessed Cartman bursts out of his bedroom. Kyle is unable to say, \"You bastard\" (saying \"You ba---\") before he flees the Cartman house."},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Helen Keller! The Musical",
            "description": "Crushed by a fallen stage light meant to kill Timmy's dysfunctional turkey, Gobbles. Stan says the line as \"O mah Gah! Dey gil Genny!\" as a result of the fake beard in his costume hurting his face."},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Wacky Molestation Adventure",
            "description": "Kenny's body is discovered by Mark Cotner and Linda Cotner, sacrificed at the \"Carousel\" ritual. Linda: \"What is it?\" Mark: \"It's a boy, they... killed him.\" Linda: \"The bastards!\""},
            {"medium": "Television",
            "season": "4",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "A Very Crappy Christmas",
            "description": "Run over by a car. Kenny's death occurs while the boys are in the middle of producing The Spirit of Christmas, so Stan decides to have Kenny's character die in the film so they would not have to re-shoot anything."},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "It Hits the Fan",
            "description": "Although he survives the plague from which he is suffering (brought on by the voluminous amount of the word \"shit\"), he vomits his intestines out just before the credits just after it is remarked that he did not die. Stan: \"Holy shi...! Poo.\""},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Cripple Fight",
            "description": "During Gloria Allred's speech near the end, a giant bird carries Kenny away in its talons and presumably eats him. However, due to a continuity error, he is seen alive during the Mountain Scout meeting at the end of the episode."},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Super Best Friends",
            "description": "Drowns himself in the Reflecting Pool in front of the Lincoln Memorial as part of the Cult of Blaintology's mass suicide. Stan says his catchphrase 3 times, using it to try and find Kyle in a massive crowd a la the game Marco Polo. Kyle replies twice."},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Scott Tenorman Must Die",
            "description": "Laughs himself to death after seeing Cartman's \"I'm a little piggy\" video when Scott Tenorman shows it to the entire town. His spirit is then seen coming out of his body, still laughing (similar to <i>Who Framed Roger Rabbit</i>). When the episode is first aired, his spirit was not shown."},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Terrance and Phillip: Behind the Blow",
            "description": "Dies of blood loss after getting all of his limbs hacked off with a meat cleaver."},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Cartmanland",
            "description": "Impaled through the face with a low hanging metal pipe while riding a roller coaster. Later in the episode, Cartman points out that Kenny dies all the time."},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Proper Condom Use",
            "description": "When the boys approach the girls at their fort, Bebe throws a bladed boomerang at Clyde, who ducks, resulting in Kenny getting his face sliced in half by the boomerang. Cartman: \"Ah, bitch!\""},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Towelie",
            "description": "Falls into a vat of lava while trying to save the boys' Gamesphere (a parody of the Nintendo GameCube). Kyle reacts, saying \"Oh my God, our Gamesphere!\""},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Osama bin Laden Has Farty Pants",
            "description": "Killed alongside his Afghan counterpart by an air-strike. Stan's and Kyle's Afghan counterparts say \"Ya Allah! Koshtaen Kayvano! Tol dayoos!\", which translates to \"Oh God, they killed Kayvan! You bastards!\" in Dari Persian. Kenny is also seen talking with Kyle, Stan, and the Afghanis in the background, although his alter ego is not."},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "How to Eat with Your Butt",
            "description": "Gets run over by a motorcycle. Stan and Kyle do not say their lines, while Cartman laughs at his death."},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Entity",
            "description": "Shot in the head by a dimwitted airport security officer who finds a toenail clipper in his pocket during a security scan, and mistakes him for a \"terrorist\". The trademark post-Kenny-death catchphrase is not said. Instead Kyle's Jewish cousin Kyle Schwartz yells \"Oh Jesus!\""},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Here Comes the Neighborhood",
            "description": "He is seen dead in this episode, but it is never shown or mentioned how he died. One possibility is that he died after being hit in the crotch too many times when he and the others were playing Roshambo."},
            {"medium": "Television",
            "season": "5",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Kenny Dies",
            "description": "Permanently dies of muscular dystrophy (until \"Red Sleigh Down\"). This is the first of his deaths to be mourned over by most of the main and supporting characters."},
            {"medium": "Television",
            "season": "6",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Biggest Douche in the Universe",
            "description": "Rob Schneider gets possessed by Kenny after eating a roast beef joint that contains his recently exorcised soul and dies after getting impaled by a flagpole (in reference to one of Kenny's deaths from \"Weight Gain 4000\")."},
            {"medium": "Television",
            "season": "6",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Red Sleigh Down",
            "description": "While Kenny does not die, nor does he appear until the very end of the episode, Stan and Kyle's lines are said when Jesus dies in Santa's arms after he is fatally shot by an Iraqi soldier. Stan says somberly, \"Oh my God, Iraqis killed Jesus\". Kyle says, \"You bastards!\"."},
            {"medium": "Television",
            "season": "7",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "It's Christmas in Canada",
            "description": "Zapped by Saddam Hussein, posing as Prime Minister of Canada, with laser eyes, causing him to explode."},
            {"medium": "Television",
            "season": "8",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Jeffersons",
            "description": "Tossed into the ceiling by \"Mr. Jefferson\" while dressed as Blanket Jackson."},
            {"medium": "Television",
            "season": "9",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Wing",
            "description": "Shot by the Chinese mafia. Initially, his death moves Kyle to tears and he vows while holding him in his arms, \"You didn't die for nothing. We're gonna get Wing back as our client and... and make a ton of money! I swear it to you!\" Afterward, after regrouping with Stan and Cartman, he says \"They killed Kenny!\", to which Stan replies \"Bastards!\"."},
            {"medium": "Television",
            "season": "9",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Best Friends Forever",
            "description": "He is hit by an ice cream van and brought to Heaven but is resuscitated and kept alive on a feeding tube (à la Terri Schiavo)."},
            {"medium": "Television",
            "season": "9",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Best Friends Forever",
            "description": "Kenny's feeding tube is removed. The public finally decide to let Kenny die after realizing they had disrespected his wish from his will of not being seen in a vegetative state on TV. His spirit returns to heaven, the archangel Michael responds gleefully, \"Oh my god, they killed Kenny!\" before returning him to lead the armies of Heaven."},
            {"medium": "Television",
            "season": "10",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Return of Chef",
            "description": "While Kenny does not die, Stan and Kyle's lines are said when Chef suffers a gruesome death. Stan says somberly, \"Oh my God, they killed Chef.\" Kyle angrily yells, \"You bastards... you bastards!\" at the Super Adventure Club."},
            {"medium": "Television",
            "season": "10",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Make Love, Not Warcraft",
            "description": "While Kenny himself is not killed, his World of Warcraft character is killed twice by Jenkins. Upon the first instance, Stan and Kyle say their respective lines through their characters."},
            {"medium": "Television",
            "season": "11",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The List",
            "description": "During the fight between Wendy Testaburger and Bebe Stevens, Bebe's gun fires, but neither she nor Wendy have been shot. Kenny is then seen eating dinner with his parents and Kevin, only for the fired bullet to fly through the window and through the back of Kenny's head, killing him. No lines are said for his death, though two pop tarts pop out of the toaster seconds after. This is the second time Bebe has killed Kenny (the first being in \"Proper Condom Use\")."},
            {"medium": "Television",
            "season": "13",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Ring",
            "description": "Dies from syphilis after receiving oral sex from his girlfriend Tammy Warner behind the local TGI Fridays restaurant."},
            {"medium": "Television",
            "season": "13",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "W.T.F.",
            "description": "Blown up by a malfunctioning rocket fired by Coach Conners in an attempt to kill Vince McMahon. Since Kenny was portraying a Mexican wrestler, two of the Mexican fans in the stand stated the famous line in Spanish, referring to Kenny as his wrestling alter ego, \"El Pollo Loco\". Nevertheless, he is heard talking (and supposedly fighting) with Cartman at the ending scene, where the boys are not on camera (Cartman was fighting Kyle just before that)."},
            {"medium": "Television",
            "season": "13",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Pee",
            "description": "Drowns in the mass of urine after the water park floods without his parka on. Stan exclaims \"Oh my God, they killed Kenny!\", but nobody replies as Kyle is not with him."},
            {"medium": "Television",
            "season": "14",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Sexual Healing",
            "description": "Dies as a result of autoerotic asphyxiation, after choking himself with a belt while dressed as Batman upon the suggestion of a Center for Disease Control and Prevention agent testing for sex addiction."},
            {"medium": "Television",
            "season": "14",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Mysterion Rises",
            "description": "He is stabbed in the heart as Mysterion by the Cult of Cthulhu's leader, he wakes up alive and well in his bed the next day, his inability to remain dead is implied to be a result of Cthulhu's power. The lines \"Oh my God, they killed Kenny!\" and \"You bastards!\" were used respectively."},
            {"medium": "Television",
            "season": "14",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Coon vs. Coon &amp; Friends",
            "description": "As Mysterion, shot himself to make Coon and Friends remember him dying."},
            {"medium": "Television",
            "season": "14",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Coon vs. Coon &amp; Friends",
            "description": "As Mysterion, he kills himself in an attempt to be reborn and escape the City of R'Lyeh; he does so by leaping into a pit of large protruding metal blades and spires, and he is impaled."},
            {"medium": "Television",
            "season": "14",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Coon vs. Coon &amp; Friends",
            "description": "Shot himself again as Mysterion after Mintberry Crunch saves them and is seen being reborn."},
            {"medium": "Television",
            "season": "15",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Poor Kid",
            "description": "Just as the school children praise Kenny for his accomplishments (and Cartman sings with glee about how he is no longer the poorest kid in the school), a gigantic reptilian bird (the existence of which was previously foreshadowed by the agnostic Mr. Weatherhead) breaks through the ceiling and tosses Kenny around with its mouth, right before he eats him whole, and flies away. The normal lines are not used; Stan simply replies, \"What the fuck?\" Cartman then sulks at the fact he is now the poorest kid in school again."},
            {"medium": "Television",
            "season": "16",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "I Should Have Never Gone Ziplining",
            "description": "Dies of boredom while riding on a boat going 5 mph. Other factors that led up to his boredom include ziplining and horseback riding with tour groups. This death is seen in a live-action sequence and is the only death to do so. Kyle says the usual line when Kenny dies. Cartman, thinking Kyle was the one who suggested ziplining, retorts \"No, not they, YOU! Look at what your ziplining idea has done! You killed Kenny, YOU're the bastard!\" Kyle replies that he thinks it was Cartman's idea and adds \"YOU killed Kenny, you bastard!\" When Stan reveals that ziplining was his idea all along, Cartman says \"You... You killed Kenny!\" and Kyle says \"You bastard! You bastard, Stan!\""},
            {"medium": "Television",
            "season": "17",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Titties and Dragons",
            "description": "Dressed as Princess Kenny, he jumps out of the window at the Sony headquarters building in Japan in an attempt to fly. Princess Kenny crashes violently onto the pavement with blood splattering, horrifying pedestrians and the Sony employees. Princess Kenny, however, is quickly revived with the powers of cuteness and flies away to attend the Red Robin Wedding."},
            {"medium": "Television",
            "season": "21",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Put It Down",
            "description": "Shown via a photograph as one of the kids who have been \"killed by a President on their phone\"."},
            {"medium": "Television",
            "season": "22",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Bike Parade",
            "description": "Gets killed by Alexa offscreen under Jeff Bezos' orders. At the end of the episode, Cartman is seen hauling his casket during the bike parade."},
            {"medium": "Television",
            "season": "24",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Pandemic Special",
            "description": "Shot by Harrison Yates' tank while running away from the police."},
            {"medium": "Movie",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "South Park: Bigger, Longer &amp; Uncut",
            "description": "Suffers severe burns after he lights his fart on fire but is ultimately killed by the ER doctors who replace his heart with a baked potato, which causes him to explode and splatter some of his innards across the hospital room."},
            {"medium": "Movie",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "South Park: Post Covid",
            "description": "Was said to have died of COVID-19 Delta Plus Rewards Program variant, after having traveled back in time in an attempt to stop the virus. His death serves as a major plotline for the movie. This death is undone during the events of <i>South Park: Post Covid: The Return of Covid</i>."},
            {"medium": "Pilot Episodes",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Jesus vs. Frosty",
            "description": "There is a boy resembling Cartman referred to as Kenny in this short, while an unnamed character has an appearance similar to Kenny. Both of these characters are caught in Frosty's tentacles and thrown to their deaths."},
            {"medium": "Pilot Episodes",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Jesus vs. Santa",
            "description": "Santa's psychic attack misses Jesus and hits Kenny, throwing his head into a statue of Orgazmo. Kenny is not the only one to die as six other children are crushed to death, either by Jesus's attack on Santa's grotto or the aforementioned statue."},
            {"medium": "Pilot Episodes",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Unaired Pilot",
            "description": "Kenny dies the same way he did in \"Cartman Gets an Anal Probe\", but he comes back at the end of the episode."},
            {"medium": "Short",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "\"Kenny Killed By Tree\" Promo",
            "description": "Gets crushed by a tree."},
            {"medium": "Short",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Jay Leno Short",
            "description": "Jay Leno's chin bumps into a flagpole in the classroom, which knocks a bust of George Washington onto Kenny's head. Stan: \"Oh my God! Jay Leno's chin killed Kenny!\" Kyle: \"You bastard!\" Leno: \"Oh, who cares? He dies in every damn episode! Look, I'm outta here!\""},
            {"medium": "Short",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "A Mother's Courage",
            "description": "Accidentally chops his arms off and stabs himself with a knife while carving a pumpkin."},
            {"medium": "Short",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Dead Friend Sketch",
            "description": "Kenny plays the part of the dead parrot in this parody of the Monty Python sketch. Cartman is also killed when the Monty Python foot lands on him."},
            {"medium": "Short",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Gauntlet",
            "description": "Maximus stabs Kenny with his sword. Stan: \"Oh my God, Russell Crowe killed Kenny!\" Timmy: \"Timmy!\""},
            {"medium": "Short",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "1998 New Year's Countdown",
            "description": "After the count down, the \"7\" falls down, revealing an \"8\" for 1998, and crushes Kenny."},
            {"medium": "Short",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The 12th Annual American Comedy Awards",
            "description": "Gets electrocuted while adjusting the TV reception. Stan: \"Oh my God, the American Comedy Awards killed Kenny!\""},
            {"medium": "Short",
            "image": "",
            "title": "51st Annual Primetime Emmy Awards (1999)",
            "description": "After the \"We Remember You\" song, the boys realize they should not stand next to Kenny. They move away, and a giant Emmy falls and crushes him."},
            {"medium": "Short",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "Kenny's Dead",
            "description": "Gets run over by a car driven by Chef and Master P"},
            {"medium": "Short",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "The Real South Park",
            "description": "Gets run over by a tram."},
            {"medium": "Short",
            "image": "",
            "title": "Los Angeles Kings Shorts",
            "description": "There are several instances where Kenny gets pummeled by Cartman's hockey stick, or run over by an ice resurfacer."},
            {"medium": "Video Game",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "South Park",
            "description": "Promotional artwork for the game shows Kenny crushed by a giant copy of the game."},
            {"medium": "Video Game",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "South Park",
            "description": "In the opening sequence, his head is bitten off by the Iguana Entertainment logo. (N64/PC versions only)"},
            {"medium": "Video Game",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "South Park",
            "description": "In Operation: Turkey Butt, he gets crushed by a door while chasing a giant turkey. If the player was using Kenny they change to Cartman for the rest of the fight. He appears resurrected at the end of the level, albeit all stitched together."},
            {"medium": "Video Game",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "South Park",
            "description": "In Something Wicked This Way Clunks, after the boys save Jimbo and Ned from the robots, Kenny gets himself crushed by a falling robot head."},
            {"medium": "Video Game",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "South Park",
            "description": "At the end of the game, Chef is congratulating them and a padlock safe falls on Kenny. Chef: \"Oh my god, they killed Kenny!\" Kyle: \"Dude, who's they? A safe fell on him.\" Stan: \"Well, we always say 'they'. We always say 'they' killed Kenny.\" Kyle: \"Doesn't make any sense, though.\" Stan: \"Oh yeah.\""},
            {"medium": "Video Game",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "South Park Rally",
            "description": "During the opening credits, Kenny runs out of gas on the train track, gets crushed by a train, and his head goes flying off and hits the South Park sign. This is a reference to \"Cartman's Mom is a Dirty Slut\"; Kenny even drives the same go-kart."},
            {"medium": "Video Game",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "South Park Pinball",
            "description": "Promotional artwork for the game shows Kenny's corpse crushed under a giant pinball while Stan, Kyle, Cartman, and Butters look on in horror."},
            {"medium": "Video Game",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "South Park Pinball",
            "description": "If the player manages to activate and win the \"Kill Kenny Bonus\" (earned by knocking the pinball into Kenny's slot three times, then one more time), Kenny (on the screen) is gunned down by an unknown assailant, while the Kenny figure falls over."},
            {"medium": "Video Game",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "South Park: The Fractured But Whole",
            "description": "One of his abilities, \"Cruel Fate\", involves him sacrificing himself to damage enemies. He then becomes a ghost and can only be revived with \"Mysterion Re-rising\"."},
            {"medium": "Video Game",
            "image": "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D",
            "title": "South Park: Phone Destroyer",
            "description": "Gets killed twice by New Kid, first as Inuit Kenny, and then as Cyborg Kenny. After his first death, he comments \"OMG! You killed me! You bastard! Hahaha JK.\" After his second death, a cutscene will show his injured body lying on the ground. Stan: \"Oh my God! The New Kid killed Kenny!\" Kyle: \"You Bastard!\""},
            {"medium": "Video Game",
            "image": "",
            "title": "Cartman's Escape Room",
            "description": "When Kenny goes to crawl through a ventilation shaft, the fan gets turned on, sucking Kenny towards and hitting the fan, and dies."}
        ]
}